[{"url": "https://sites.rutgers.edu/ru-wit/event/women-in-it-panel/", "html": "Skip to main contentRutgers.eduNew BrunswickRBHSNewarkCamdenOnlineRutgers HealthRutgers Search Rutgers University Women in Technology Group s Facebook Page LinkedIn PageRutgers University LogoRutgers University Women in Technology Group MenuHomeNewsCalendarResourcesTeamAboutContactGroup Page Open Search InputGeneric selectorsExact matches only\r                    Exact matches only                Search in title\r                    Search in title                Search in content\r                    Search in content                Search in excerptHiddenHiddenHiddenHiddenFilter by CategoriesNews\r                            News                        Uncategorized\r                            Uncategorized                        More results... « All EventsWomen in IT PanelJune 17 @ 12:00 pm - 1:00 pm « RU-WIT – Working Group Planning MeetingZoom Registration LinkLearn about 3 different women and their educational and professional journeys in the technical fields, which started at various points from the ’70s to the ’90s. How did the challenges they faced, and the success they achieved, overlap and diverge?Join us as we hear their stories and learn from their experiences to help ourselves and to help improve and/or create pathways for all women and underrepresented groups.Click for the Complete Flyer – Women in IT PanelOur Panelists:Dr. Deborah Silver, Professional Science Master’s program at Rutgers, The State University of New JerseyArlene Rosenbaum, Former President of a Direct Marketing computer service bureauDr. Nihal Nounou, Strategy and Performance Management – Principle ConsultantOur Moderators:Abeer Elahraf, Assistant Dean for Data Management and SecurityLaura Gordon, Web Developer, Rutgers, School of Arts and SciencesAbout our Panelists:Dr. Deborah SilverDr. Deborah Silver is the executive director of the Professional Science Master’s program at Rutgers, The State University of New Jersey. This program offers the novel Master of Business and Science degree. Dr. Silver, a Rutgers PSM cofounder, has served as executive director since the program’s inception in 2010. Today, Rutgers PSM is one of the largest master’s programs at Rutgers University, and one of the largest and most diverse Professional Science Master’s programs in the nation. A full professor in Rutgers University’s Department of Electrical and Computer Engineering, Dr. Silver received her bachelor’s degree in computer science from Columbia University’s School of Engineering and Applied Sciences and earned her doctorate in computer science from Princeton University. From 2008 to 2010, she served as Associate Dean of Continuing and Professional Education for Rutgers School of Engineering. Dr. Silver’s area of research is data visualization, and in 2020, she was honored for her achievements and contributions to the field of data visualization via her induction into the Institute of Electrical and Electronics Engineers’ IEEE prestigious Visualization Academy. Dr. Silver currently serves on the Board of Governors for the IEEE Computer Society and as a board member of the National Professional Science Master’s Association.  Dr. Nihal NounouDr. Nihal Nounou is one of the founding members of Horizons since its inception and managed the company through its beginning years providing leadership in both business and technical areas. Dr. Nounou has more than 25 years of experiencein Business and IT consulting. Dr. Nounou is the Director and Principal Consultant of the Balance Scorecard Development and Strategy Management solution service. Dr. Nounou is also the Director and Principal Consultant of the Business Process Management and automation solution.She is also an expert on COBIT 2019 assessment and design prioritization.Dr. Nihal is the leader of the Strategy Architect: a Strategic Performance Management using the Balanced Scorecard software product. Dr. Nounou has been invited as a speaker in several Balanced Scorecard and Strategy Management conferences in the Gulf region.Dr. Nounou has been teaching computer science courses at leading universities in the US and Egypt in the past 30years both as full-timeprofessor and as adjunct professor. Dr. Nounou have authored and coauthored many papers in the field of computer communication networks and software development. Dr. Nounou completed her undergraduate work in Computer Engineering at Ain-Shams University, and received her Master’s and Doctorate degrees in Computer Science from Columbia University, New York, USA. Dr. Nounou was Associate and Assistant professor at Drew University, Rutgers University in New Jersey, USA; and at Pace University in New York, USA till 1999 when she moved to Cairo Egypt. Dr. Nounou also worked asan Adjunct Professor in the Computer Engineering and Computer Science departments at the Arab Academy of Science and Technology, Cairo, Egypt. Arlene RosenbaumArlene Rosenbaum graduated from City College of New York in 1964 with a BS in Mathematics. Her first job was with the City of New York Department of Finance where she went for extensive training with IBM on  the new IBM 360 mainframes. She learned Assembler language and Operating systems maintenance and moved to General Foods where she worked on the IBM mainframe operating systems until she  took a few years off  to have two wonderful daughters.  When she went back to work, she began doing software consulting for a small Direct Marketing computer service bureau. There she became extremely interested in the technology of deduping names and addresses and building massive customer and prospect databases for large companies. She became president of that small company, went on to sell it and started her own company to consult with companies in deduping and database development. Her clients included Sara Lee, Talbots, Dell, Verizon, City Bank, Bank of America, and Amex   + Google Calendar+ iCal Export Details  Date:  June 17  Time: \t\t\t\t\t12:00 pm - 1:00 pm\t\t\t\t\t\t\t\t\t Website:  https://rutgers.zoom.us/webinar/register/WN_7h86or1FQOGMaqHMSWqIfQ  Venue  Zoom Organizer\t\t\t\tRutgers – WIT Group\t\t\t\t\t\t\t\t\tWebsite:\t\t\t\t\thttps://sites.rutgers.edu/ru-wit  « RU-WIT – Working Group Planning Meeting  Recent PostsJourney through the Decades eventThe Lack of Diversity in STEM Stops With UsResearch Finds that Gender Gap Toward CS RemainsAddressing the Underrepresentation of Women of Color in TechBig Ten Academic Alliance BTAA Women in IT WIT Virtual EventUpcoming EventsWomen in IT PanelJune 17 @ 12:00 pm - 1:00 pm View All EventsArchivesMay 2021December 2020October 2020April 2020March 2020February 2020January 2020November 2019October 2019September 2019July 2019June 2019May 2019April 2019March 2019CategoriesNewsUncategorizedNews in WITJourney through the Decades eventMay 19, 2021The Lack of Diversity in STEM Stops With UsDecember 8, 2020Research Finds that Gender Gap Toward CS RemainsOctober 26, 2020Addressing the Underrepresentation of Women of Color in TechApril 26, 2020Big Ten Academic Alliance BTAA Women in IT WIT Virtual EventMarch 10, 2020Upcoming EventsWomen in IT PanelJune 17 @ 12:00 pm - 1:00 pm View All EventsRU – WIT Quick LinksNewsResources Contact Webmaster | AccessibilityRutgers is an equal access/equal opportunity institution. Individuals            with disabilities are encouraged to direct suggestions, comments, or complaints concerning any            accessibility issues with Rutgers web sites to accessibility@rutgers.edu            or complete the Report Accessibility Barrier or                Provide Feedback Form.Copyright ©2021, Rutgers, The State University of                New JerseyAccessibility Information×Rutgers is an equal access/equal opportunity institution. Individuals with disabilities are                    encouraged to direct suggestions, comments, or complaints concerning any accessibility issues                    with Rutgers web sites to accessibility@rutgers.edu or complete the Report Accessibility Barrier or                        Provide Feedback Form.Close"}, {"url": "https://www.engr.ucr.edu/", "html": "Access BCOE COVID-19 information and guidance.   Submit a return-to-work proposal.   Request a one-time visit to BCOE.  Take the daily wellness check survey.Skip to main contentMarlan and Rosemary Bourns College of EngineeringBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in EngineeringSearchUC Riverside Marlan and Rosemary Bourns College of Engineering Celebrating 30 YearsSearchStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership Departments and ProgramsBioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usStudentsProspective UndergradWhy BCOE?Majors & Programs TransferScholarshipsMeet AlumniApply NowProspective GraduateApply NowVisit BCOECurrent StudentsBS + MS ProgramUCR Education Abroad OfficeUndergrad researchAdvisingTransfer centerCampus resourcesSchool calendarStudent NewslettersResearchResearch CapabilitiesResearch centersUndergraduate ResearchFacilitiesUser FacilitiesMSE User FacilitiesNanofabrication FacilityMachine Shop Central Facility for Advanced Microscopy and MicroanalysisParentsBCOE BoostersNew Parent FAQsPartnersIndustry PartnersME CO-OP ProgramDeans innovation fundCouncil of AdvisorsMake a giftAlumniAlumniMentorRecruitMake a giftAboutMessage from the deanCollege leadership BioengineeringChemical & Environmental EngineeringComputer EngineeringComputer Science & EngineeringElectrical & Computer EngineeringMasters in Engineering OnlineMaterials Science & EngineeringMechanical EngineeringPeopleEmploymentNewsEventsContact usBCOE Departments & ProgramsMARLAN AND ROSEMARY BOURNS COLLEGE OF ENGINEERINGBioengineeringChemical and Environmental EngineeringComputer EngineeringComputer Science and EngineeringData ScienceElectrical and Computer EngineeringMaterials Science and EngineeringMechanical EngineernigOnline M.S. in Engineering            Calling all 2021 graduates!                We want to hear about your next destination. Share your story to help future cohorts get a glimpse of “what’s next” after graduation.Share Story            Transfer Student Experiences    Learn more            Graduate Students in Charge    Learn more about our graduate programs            The Bourns College of Engineering    Find out how you can givePreviousNextBreadcrumbNews10 Jun      Luat Vuong receives DARPA Director’s Fellowship of the Young Faculty Award Program          Vuong’s unique image processing technology combines arthropod-inspired vision system and artificial intelligence algorithms    Read More »aboutLuat Vuong receives DARPA Director’s Fellowship of the Young Faculty Award Program07 Jun      Study of perception and memory in older adults will improve understanding of dementias          UC Riverside scientists will use a $2 million NIH grant to study the brain’s locus coeruleus    Read More »aboutStudy of perception and memory in older adults will improve understanding of dementias03 Jun      A new water treatment technology could also help Mars explorers          A catalyst that destroys perchlorate in water could clean Martian soil     Read More »aboutA new water treatment technology could also help Mars explorers02 Jun      Poor air quality and warehouses linked to Inland Empire Covid-19 inequities          UC Riverside professors call for intersectional approach to Covid-19 exposure interventions    Read More »aboutPoor air quality and warehouses linked to Inland Empire Covid-19 inequities26 May      $79,000 raised for Professor Emeritus Tom Payne’s 79th birthday          The Thomas H. Payne Scholarship in Computer Science, which supports undergraduate students in computer science, has grown to $79,079, just in time for Professor Paynes 79th birthday.    Read More »about$79,000 raised for Professor Emeritus Tom Payne’s 79th birthday25 May      UC Riverside offers UC systems first masters degree in robotics          Algorithmic bias is one problem the program will tackle    Read More »aboutUC Riverside offers UC systems first masters degree in robotics24 May      Tiny tomatoes could mean big profits for urban agriculture          Grants support continued development of tomatoes for vertical farming    Read More »aboutTiny tomatoes could mean big profits for urban agriculture21 May      Bourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County          Each year, the Society of Women Engineers SWE, one of the Marlan and Rosemary Bourns College of Engineering’s BCOE more than 20 professional student organizations, hosts Bourns Science and Engineering Day BSED, formerly called Bourns Engineering Day, a community outreach event introducing STEM to local K-12 students through activities, speakers and lessons. Despite this year’s event moving completely online for the first time, due to the remote setting, many more schools were able to attend in addition to typical attendees from Riverside Unified School District. Students and teachers    Read More »aboutBourns Science and Engineering Day expands STEM outreach to include school districts in Orange County and Los Angeles County21 May      Implantable piezoelectric polymer improves controlled release of drugs          Repeated tests showed a similar amount of drug release per activation, confirming robust control of release rate    Read More »aboutImplantable piezoelectric polymer improves controlled release of drugs18 May      UCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes          Assistant professor of computer science Evangelos Papalexakis has been awarded the prestigious National Science Foundation NSF CAREER Award on autonomous tensor analysis towards actionable insights from raw multi-aspect data, with applications for detecting misinformation online and detecting gravitational waves.    Read More »aboutUCR computer scientist earns NSF CAREER award to combat online misinformation and unlock the mystery of black holes17 May      Nanofiber filter captures almost 100% of coronavirus aerosols          The filter could help curb airborne spread of COVID-19 virus    Read More »aboutNanofiber filter captures almost 100% of coronavirus aerosols11 May      UCR researchers awarded grant to improve technical communication skills in STEM students          Mona Eskandari, assistant professor of mechanical engineering, Mariam Salloum, assistant teaching professor of computer science, and Annika Speer, assistant teaching professor of theater, film and digital production, were awarded a research grant from the Engineering Information Foundation to enhance technical communication in engineering and science. The proposal identified a need for UC Riverside STEM students to receive more practical coaching, delivery evaluation, and presentation feedback. The executed research goals aim to address these needs by creating tangible public speaking training    Read More »aboutUCR researchers awarded grant to improve technical communication skills in STEM studentsMore from news.ucr.edu                            Top 50                                            U.S. public engineering college U.S. News & World Report                                            9                                            world-class research centers                                            300,000+                                             square feet of lab and research space                                            133                                            Faculty                                            2,864                                            Undergraduate Students                                            936                                            Graduate Students                SearchUniversity of California, Riverside900 University Ave.            Riverside, CA 92521Tel: 951 827-1012UCR LibraryCampus StatusCampus StoreCareer OpportunitiesDiversityMaps and DirectionsVisit UCRMarlan and Rosemary Bourns College of Engineering             446 Winston Chung Hall            900 University Ave.             Riverside, CA 92521              tel: 951 827-5190                 fax: 951 827-3188         email: news@engr.ucr.edu Related LinksBCOE Available Conference Rooms and Technology ResourcesGive to BournsIntranetFaculty ResourcesMarketing ResourcesSystemsFollow US:Visit BCOEs Facebook page external site: FacebookFollow BCOE on Twitter external site: TwitterVisit BCOEs YouTube channel external site: YouTubeVisit BCOEs Flickr gallery external site: FlickrSubscribe to BCOE News via RSS FeedPrivacy PolicyTerms and Conditions© 2021 Regents of the University of California×Let us help you with your searchEnter your Search Criteria.Search All UCRSearch This SiteCancel"}]